---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussInvalidSymbolGeom
source: html/6f785510-5d44-5efc-f093-1a5030a85daa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussInvalidSymbolGeom Property

Truss is unable to generate any members due to layout family error.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussInvalidSymbolGeom { get; }
```